Catalogs/Кандидаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Кандидаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныеДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резюме</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезюмеТекст</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзвлеченияТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИзвлеченияТекстаФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтклоненияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднийРейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРезюме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОСебе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьДохода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьОжидаемогоДоходаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭтапРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КомментарииКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КомментарииКандидатов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доступность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступностьКомментарияКандидата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСкрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоПубликации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДоступностьКомментарияКандидата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДоступностьКомментарияКандидата</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общедоступный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Кандидаты/Forms/СписокКомментариев/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	КандидатСсылка = Параметры.Кандидат;
	ЗаполнитьКомментарии(Параметры.Комментарии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарииСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	НачатьИзменениеКомментария(ВыбраннаяСтрока);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КомментарииСписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	НачатьДобавлениеКомментария();
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомментарииСписокПередУдалением(Элемент, Отказ)

	СтрокаНабора = Элемент.ТекущиеДанные;
	Если Не ПодборПерсоналаКлиент.ПроверитьКомментарийПередУдалением(СтрокаНабора) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	КомментарииКандидатовНаборЗаписей.Удалить(СтрокаНабора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, 
		"Доступность", Перечисления.ДоступностьКомментарияКандидата.Общедоступный);
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.КомментарииСписокТолькоДляАвтора.Имя);

	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, 
		"Доступность", Перечисления.ДоступностьКомментарияКандидата.ТолькоДляАвтора);
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Истина);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.КомментарииСписокТолькоДляАвтора.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомментарии(Комментарии)
	
	КомментарииКандидатовНаборЗаписей.Очистить();
	
	Для Каждого СтрокаТаблицы Из Комментарии Цикл
		НоваяСтрока = КомментарииКандидатовНаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.АвторПредставление = ПредставлениеАвтораКомментария(СтрокаТаблицы.Пользователь);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьИзменениеКомментария(ИдентификаторСтроки)
	
	ПараметрыФормы = ПодборПерсоналаКлиентСервер.ПараметрыРедактированияКомментарияКандидата();
	
	СтрокаНабора = КомментарииКандидатовНаборЗаписей.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, СтрокаНабора);
	
	ДополнительныеПараметры = Новый Структура("НомерКомментария");
	ДополнительныеПараметры.НомерКомментария = ИдентификаторСтроки;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьИзменениеКомментария", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("РегистрСведений.КомментарииКандидатов.Форма.КомментарийКандидата", ПараметрыФормы, ЭтаФорма, ЭтаФорма, , , ОписаниеОповещения);
	
КонецПроцедуры

// Завершить изменение комментария.
// 
// Параметры:
//  Результат - см. ПодборПерсоналаКлиентСервер.РезультатРедактированияКомментария
//  ДополнительныеПараметры - Структура
&НаКлиенте
Процедура ЗавершитьИзменениеКомментария(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	НомерКомментария = ДополнительныеПараметры.НомерКомментария;
	СтрокаНабора = КомментарииКандидатовНаборЗаписей.НайтиПоИдентификатору(НомерКомментария);
	
	Если Результат.Действие = ПодборПерсоналаКлиентСервер.ДействияСКомментариемПриРедактировании().Изменение Тогда
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Результат.Данные);
		СтрокаНабора.Период = ОбщегоНазначенияКлиент.ДатаСеанса();
	ИначеЕсли Результат.Действие = ПодборПерсоналаКлиентСервер.ДействияСКомментариемПриРедактировании().Удаление Тогда
		КомментарииКандидатовНаборЗаписей.Удалить(СтрокаНабора);
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, 
			НСтр("ru = 'Неопознанное действие в результате редактирования комментария'"), 
			"Справочник.Кандидаты.Формы.СписокКомментариев");
	КонецЕсли;
	
	КомментарииКандидатовНаборЗаписей.Сортировать("Период Убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьДобавлениеКомментария()
	
	ПараметрыФормы = Новый Структура("Пользователь, Действие");
	ПараметрыФормы.Пользователь = ПользователиКлиент.АвторизованныйПользователь();
	ПараметрыФормы.Действие = ПодборПерсоналаКлиентСервер.ДействияСКомментариемПриРедактировании().Добавление;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьДобавлениеКомментария", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.КомментарииКандидатов.Форма.КомментарийКандидата", ПараметрыФормы, 
		ЭтотОбъект, ЭтотОбъект, , , ОписаниеОповещения);
	
КонецПроцедуры

// Завершить добавление комментария.
// 
// Параметры:
//  Результат - см. ПодборПерсоналаКлиентСервер.РезультатРедактированияКомментария
//  ДополнительныеПараметры - Структура
&НаКлиенте
Процедура ЗавершитьДобавлениеКомментария(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Результат.Действие = ПодборПерсоналаКлиентСервер.ДействияСКомментариемПриРедактировании().Добавление, 
		НСтр("ru = 'Неопознанное действие в результате добавления комментария'"), 
		"Справочник.Кандидаты.Формы.СписокКомментариев");
	
	Модифицированность = Истина;
	
	СтрокаНабора = КомментарииКандидатовНаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаНабора, Результат.Данные);
	СтрокаНабора.Период = ОбщегоНазначенияКлиент.ДатаСеанса();
	СтрокаНабора.Кандидат = КандидатСсылка;
	СтрокаНабора.Пользователь = ПользователиКлиент.АвторизованныйПользователь();
	СтрокаНабора.АвторПредставление = ПредставлениеАвтораКомментария(СтрокаНабора.Пользователь);
	
	КомментарииКандидатовНаборЗаписей.Сортировать("Период Убыв");
	
КонецПроцедуры

&НаКлиенте
Функция СписокКомментариев()
	
	Комментарии = Новый Массив;
	Для Каждого СтрокаНабора Из КомментарииКандидатовНаборЗаписей Цикл
		ЗаписьКомментария = ПодборПерсоналаКлиентСервер.ПараметрыРедактированияКомментарияКандидата();
		ЗаполнитьЗначенияСвойств(ЗаписьКомментария, СтрокаНабора);
		Комментарии.Добавить(ЗаписьКомментария);
	КонецЦикла;
	
	Возврат Комментарии;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ТолькоПросмотр Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	Комментарии = СписокКомментариев();
	
	Модифицированность = Ложь;
	Закрыть(Комментарии);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеАвтораКомментария(АвторКомментария)
	Возврат ПодборПерсоналаФормы.ПредставлениеАвтораКомментария(АвторКомментария);
КонецФункции

#КонецОбласти
